scenkov/ardurevo/Acopter32-STM32F4/libraries/AP_HAL_VRBRAIN/hardware/hal/i2c.c
    /* I2C configuration */
    I2C_StructInit(&I2C_InitStructure);
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = address;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = speed;

    I2C_ITConfig(dev->I2Cx, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR, DISABLE);

    /* I2C Peripheral Enable */
    I2C_Cmd(dev->I2Cx, ENABLE);
    /* Apply I2C configuration after enabling it */
    I2C_Init(dev->I2Cx, &I2C_InitStructure);

    sEEAddress = sEE_HW_ADDRESS;

    I2C_BLOCKED = 0;
    }

/**
 * @brief  DeInitializes peripherals used by the I2C EEPROM driver.
 * @param  None
 * @retval None
 */
void i2c_deinit(i2c_dev *dev)
    {
    i2c_lowLevel_deinit(dev);
    }

/*
 void i2c_set_speed(i2c_dev *dev, uint32_t speed)
 {
 I2C_InitTypeDef  I2C_InitStructure;
 I2C_InitStructure.I2C_ClockSpeed = speed;
 I2C_Init(dev->I2Cx, &I2C_InitStructure);
 }
 */

/**
 * @brief  Initializes DMA channel used by the I2C EEPROM driver.
 * @param  None
 * @retval None
 */
void sEE_LowLevel_DMAConfig(uint32_t pBuffer, uint32_t BufferSize,
	uint32_t Direction)
    {
    /* Initialize the DMA with the new parameters */
    if (Direction == sEE_DIRECTION_TX)
	{
	/* Configure the DMA Tx Stream with the buffer address and the buffer size */
	sEEDMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) pBuffer;
	sEEDMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
	sEEDMA_InitStructure.DMA_BufferSize = (uint32_t) BufferSize;
	DMA_Init(sEE_I2C_DMA_STREAM_TX, &sEEDMA_InitStructure);
	}
    else
	{
	/* Configure the DMA Rx Stream with the buffer address and the buffer size */
	sEEDMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) pBuffer;
	sEEDMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
	sEEDMA_InitStructure.DMA_BufferSize = (uint32_t) BufferSize;
	DMA_Init(sEE_I2C_DMA_STREAM_RX, &sEEDMA_InitStructure);
	}
}

uint8_t i2c_is_busy()
    {
    return I2C_BLOCKED;
    }

/**
 * @brief  Wait for EEPROM Standby state.
 *
 * @note  This function allows to wait and check that EEPROM has finished the
 *        last operation. It is mostly used after Write operation: after receiving
 *        the buffer to be written, the EEPROM may need additional time to actually
 *        perform the write operation. During this time, it doesn't answer to
 *        I2C packets addressed to it. Once the write operation is complete
 *        the EEPROM responds to its address.
 *
 * @param  None
 * @retval sEE_OK (0) if operation is correctly performed, else return value
 *         different from sEE_OK (0) or the timeout user callback.
 */
uint32_t sEE_WaitEepromStandby(i2c_dev *dev, uint8_t addr)
    {

    __IO uint16_t tmpSR1 = 0;
    __IO uint32_t sEETrials = 0;

    I2CADDRESS = addr;

    /*!< While the bus is busy */
    sTimeout = I2C_LONG_TIMEOUT;
    while (I2C_GetFlagStatus(dev->I2Cx, I2C_FLAG_BUSY ))
	{
	if ((sTimeout--) == 0)
	    return I2C_ERROR;
	}

    /* Keep looping till the slave acknowledge his address or maximum number
     of trials is reached (this number is defined by sEE_MAX_TRIALS_NUMBER define
     in STM324x7I_eval_i2c_ee.h file) */
    while (1)
	{
	//Disable interrupts
	//I2C_ITConfig(dev->I2Cx, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR, DISABLE);

	/*!< Send START condition */
	I2C_GenerateSTART(dev->I2Cx, ENABLE);

	/*!< Test on EV5 and clear it */
	sTimeout = I2C_TIMEOUT;
	while (!I2C_CheckEvent(dev->I2Cx, I2C_EVENT_MASTER_MODE_SELECT ))
	    {

	    }
	if ((sTimeout--) == 0)
	    {
	    //I2C_ITConfig(dev->I2Cx, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR, ENABLE);
	    return I2C_ERROR;
	    }

	/*!< Send EEPROM address for write */
	I2C_Send7bitAddress(dev->I2Cx, I2CADDRESS, I2C_Direction_Transmitter );

	/* Wait for ADDR flag to be set (Slave acknowledged his address) */
	sTimeout = I2C_LONG_TIMEOUT;
	do
	    {
	    /* Get the current value of the SR1 register */
	    tmpSR1 = dev->I2Cx->SR1;

	    /* Update the timeout value and exit if it reach 0 */
	    if ((sTimeout--) == 0)
		{
		//I2C_ITConfig(dev->I2Cx, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR, ENABLE);
		return I2C_ERROR;
		}
	    }
	/* Keep looping till the Address is acknowledged or the AF flag is
	 set (address not acknowledged at time) */
	while ((tmpSR1 & (I2C_SR1_ADDR | I2C_SR1_AF ))== 0);

	/* Check if the ADDR flag has been set */
if(	tmpSR1 & I2C_SR1_ADDR)
	    {
	    /* Clear ADDR Flag by reading SR1 then SR2 registers (SR1 have already
	     been read) */
	    (void)dev->I2Cx->SR2;

	    /*!< STOP condition */
	    I2C_GenerateSTOP(dev->I2Cx, ENABLE);

	    //I2C_ITConfig(dev->I2Cx, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR, ENABLE);
	    /* Exit the function */
	    return I2C_OK;
	    }
	else
	    {
	    /*!< Clear AF flag */
	    I2C_ClearFlag(dev->I2Cx, I2C_FLAG_AF);
	    }

	/* Check if the maximum allowed number of trials has bee reached */
	if (sEETrials++ == sEE_MAX_TRIALS_NUMBER)
	    {
	    //I2C_ITConfig(dev->I2Cx, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR, ENABLE);
	    /* If the maximum number of trials has been reached, exit the function */
	    return I2C_ERROR;
	    }
	}
    }


/* Send a buffer to the i2c port */
uint32_t i2c_write(i2c_dev *dev, uint8_t addr, uint8_t *tx_buff, uint8_t *len)
{

    /* Set the pointer to the Number of data to be written. This pointer will be used
     by the DMA Transfer Completer interrupt Handler in order to reset the
     variable to 0. User should check on this variable in order to know if the
     DMA transfer has been complete or not. */
    sEEDataWritePointer = len;

    //uint16_t tosend = *len;
    uint16_t sent = 0;
    uint8_t *buffer = tx_buff;
    //uint16_t ptr;
    //int flags;

    sent = 0;
    //flags = dev->flags;

    // While the bus is busy
    /*!< While the bus is busy */
    sTimeout = sEE_LONG_TIMEOUT;
    while (I2C_GetFlagStatus(dev->I2Cx, I2C_FLAG_BUSY ))
	{
	if ((sTimeout--) == 0)
	    return I2C_ERROR;
	}

    // Send START condition
    I2C_GenerateSTART(dev->I2Cx, ENABLE);

    // Test on EV5 and clear it (cleared by reading SR1 then writing to DR)
    sTimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(dev->I2Cx, I2C_EVENT_MASTER_MODE_SELECT ))
	{
	if ((sTimeout--) == 0)
	    return I2C_ERROR;
	}

