scenkov/ardurevo/Acopter32-STM32F4/libraries/AP_HAL_VRBRAIN/hardware/hal/i2c.c
    /*!< While the bus is busy */
    sEETimeout = sEE_LONG_TIMEOUT;
    while (I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BUSY ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send START condition */
    I2C_GenerateSTART(sEE_I2C, ENABLE);

    /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_MODE_SELECT ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send EEPROM address for write */
    I2C_Send7bitAddress(sEE_I2C, sEEAddress, I2C_Direction_Transmitter );

    /*!< Test on EV6 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send the EEPROM's internal address to read from: MSB of the address first */
    I2C_SendData(sEE_I2C, (uint8_t)((ReadAddr & 0xFF00) >> 8));

    /*!< Test on EV8 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send the EEPROM's internal address to read from: LSB of the address */
    I2C_SendData(sEE_I2C, (uint8_t)(ReadAddr & 0x00FF));

    /*!< Test on EV8 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BTF ) == RESET)
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send STRAT condition a second time */
    I2C_GenerateSTART(sEE_I2C, ENABLE);

    /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_MODE_SELECT ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send EEPROM address for read */
    I2C_Send7bitAddress(sEE_I2C, sEEAddress, I2C_Direction_Receiver );

    /* If number of data to be read is 1, then DMA couldn't be used */
    /* One Byte Master Reception procedure (POLLING) ---------------------------*/
    if ((uint16_t)(*NumByteToRead) < 2)
	{
	/* Wait on ADDR flag to be set (ADDR is still not cleared at this level */
	sEETimeout = sEE_FLAG_TIMEOUT;
	while (I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_ADDR ) == RESET)
	    {
	    if ((sEETimeout--) == 0)
		return I2C_ERROR;
	    }

	/*!< Disable Acknowledgement */
	I2C_AcknowledgeConfig(sEE_I2C, DISABLE);

	/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
	(void) sEE_I2C ->SR2;

	/*!< STOP condition */
	I2C_GenerateSTOP(sEE_I2C, DISABLE);
	I2C_ClearFlag(sEE_I2C, I2C_FLAG_STOPF );
	/* Send STOP condition */
	I2C_GenerateSTOP(sEE_I2C, ENABLE);

	/* Wait for the byte to be received */
	sEETimeout = sEE_FLAG_TIMEOUT;
	while (I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_RXNE ) == RESET)
	    {
	    if ((sEETimeout--) == 0)
		return I2C_ERROR;
	    }

	/*!< Read the byte received from the EEPROM */
	*pBuffer = I2C_ReceiveData(sEE_I2C );

	/*!< Decrement the read bytes counter */
	(uint16_t)(*NumByteToRead)--;

	/* Wait to make sure that STOP control bit has been cleared */
	sEETimeout
	= sEE_FLAG_TIMEOUT;
	while (sEE_I2C ->CR1 & I2C_CR1_STOP )
	    {
	    if ((sEETimeout--) == 0)
		return I2C_ERROR;
	    }

	/*!< Re-Enable Acknowledgement to be ready for another reception */
	I2C_AcknowledgeConfig(sEE_I2C, ENABLE);
	}
    else/* More than one Byte Master Reception procedure (DMA) -----------------*/
	{
	/*!< Test on EV6 and clear it */
	sEETimeout = sEE_FLAG_TIMEOUT;
	while (!I2C_CheckEvent(sEE_I2C,
		I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED ))
	    {
	    if ((sEETimeout--) == 0)
		return I2C_ERROR;
	    }

	/* Configure the DMA Rx Channel with the buffer address and the buffer size */
	sEE_LowLevel_DMAConfig((uint32_t) pBuffer, (uint16_t)(*NumByteToRead),
		sEE_DIRECTION_RX);

	/* Inform the DMA that the next End Of Transfer Signal will be the last one */
	I2C_DMALastTransferCmd(sEE_I2C, ENABLE);

	/* Enable the DMA Rx Stream */
	DMA_Cmd(sEE_I2C_DMA_STREAM_RX, ENABLE);

	/* Enable the sEE_I2C peripheral DMA requests */
	I2C_DMACmd(sEE_I2C, ENABLE);
	}

    /* If all operations OK, return sEE_OK (0) */
    return I2C_OK;
    }

/**
 * @brief  Writes more than one byte to the EEPROM with a single WRITE cycle.
 *
 * @note   The number of bytes (combined to write start address) must not
 *         cross the EEPROM page boundary. This function can only write into
 *         the boundaries of an EEPROM page.
 *         This function doesn't check on boundaries condition (in this driver
 *         the function sEE_WriteBuffer() which calls sEE_WritePage() is
 *         responsible of checking on Page boundaries).
 *
 * @param  pBuffer : pointer to the buffer containing the data to be written to
 *         the EEPROM.
 * @param  WriteAddr : EEPROM's internal address to write to.
 * @param  NumByteToWrite : pointer to the variable holding number of bytes to
 *         be written into the EEPROM.
 *
 *        @note The variable pointed by NumByteToWrite is reset to 0 when all the
 *              data are written to the EEPROM. Application should monitor this
 *              variable in order know when the transfer is complete.
 *
 * @note This function just configure the communication and enable the DMA
 *       channel to transfer data. Meanwhile, the user application may perform
 *       other tasks in parallel.
 *
 * @retval sEE_OK (0) if operation is correctly performed, else return value
 *         different from sEE_OK (0) or the timeout user callback.
 */
uint32_t sEE_WritePage(uint8_t* pBuffer, uint16_t WriteAddr,
	uint8_t* NumByteToWrite)
    {
    /* Set the pointer to the Number of data to be written. This pointer will be used
     by the DMA Transfer Completer interrupt Handler in order to reset the
     variable to 0. User should check on this variable in order to know if the
     DMA transfer has been complete or not. */
    sEEDataWritePointer = NumByteToWrite;

