scenkov/ardurevo/Acopter32-STM32F4/libraries/AP_HAL_VRBRAIN/hardware/hal/i2c.c
    /*!< While the bus is busy */
    sEETimeout = sEE_LONG_TIMEOUT;
    while (I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BUSY ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send START condition */
    I2C_GenerateSTART(sEE_I2C, ENABLE);

    /*!< Test on EV5 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_MODE_SELECT ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send EEPROM address for write */
    sEETimeout = sEE_FLAG_TIMEOUT;
    I2C_Send7bitAddress(sEE_I2C, sEEAddress, I2C_Direction_Transmitter );

    /*!< Test on EV6 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send the EEPROM's internal address to write to : MSB of the address first */
    I2C_SendData(sEE_I2C, (uint8_t)((WriteAddr & 0xFF00) >> 8));

    /*!< Test on EV8 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /*!< Send the EEPROM's internal address to write to : LSB of the address */
    I2C_SendData(sEE_I2C, (uint8_t)(WriteAddr & 0x00FF));

    /*!< Test on EV8 and clear it */
    sEETimeout = sEE_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}
    if ((uint16_t)(*NumByteToWrite) > 1)
	{
	/* Configure the DMA Tx Channel with the buffer address and the buffer size */
	sEE_LowLevel_DMAConfig((uint32_t) pBuffer, (uint8_t)(*NumByteToWrite),
		sEE_DIRECTION_TX);

	/* Enable the DMA Tx Stream */
	DMA_Cmd(sEE_I2C_DMA_STREAM_TX, ENABLE);

	/* Enable the sEE_I2C peripheral DMA requests */
	I2C_DMACmd(sEE_I2C, ENABLE);

	/* If all operations OK, return sEE_OK (0) */
	return I2C_OK;
	}
    else
	{
	I2C_SendData(sEE_I2C, pBuffer[0]);
	while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTED ))
	    {
	    if ((sEETimeout--) == 0)
		return I2C_ERROR;
	    }
	/*!< STOP condition */
	I2C_GenerateSTOP(sEE_I2C, DISABLE);
	I2C_ClearFlag(sEE_I2C, I2C_FLAG_STOPF );
	/* Send STOP condition */
	I2C_GenerateSTOP(sEE_I2C, ENABLE);

	while (I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_STOPF ))
	    ; // stop bit flag

	return I2C_OK;
	}

    }

/**
 * @brief  Writes buffer of data to the I2C EEPROM.
 * @param  pBuffer : pointer to the buffer  containing the data to be written
 *         to the EEPROM.
 * @param  WriteAddr : EEPROM's internal address to write to.
 * @param  NumByteToWrite : number of bytes to write to the EEPROM.
 * @retval None
 */
uint32_t sEE_WriteBuffer(uint8_t* pBuffer, uint16_t WriteAddr,
	uint16_t NumByteToWrite)
    {
    uint8_t NumOfPage = 0, NumOfSingle = 0, count = 0;
    uint16_t Addr = 0;

    Addr = WriteAddr % sEE_PAGESIZE;
    count = sEE_PAGESIZE - Addr;
    NumOfPage = NumByteToWrite / sEE_PAGESIZE;
    NumOfSingle = NumByteToWrite % sEE_PAGESIZE;

    /*!< If WriteAddr is sEE_PAGESIZE aligned  */
    if (Addr == 0)
	{
	/*!< If NumByteToWrite < sEE_PAGESIZE */
	if (NumOfPage == 0)
	    {
	    /* Store the number of data to be written */
	    sEEDataNum = NumOfSingle;
	    /* Start writing data */
	    sEE_WritePage(pBuffer, WriteAddr, (uint8_t*) (&sEEDataNum));
	    /* Wait transfer through DMA to be complete */
	    sEETimeout = sEE_LONG_TIMEOUT;
	    while (sEEDataNum > 0)
		{
		if ((sEETimeout--) == 0)
		    {
		    return I2C_ERROR;
		    };
		}
	    sEE_WaitEepromStandbyState();
	    }
	/*!< If NumByteToWrite > sEE_PAGESIZE */
	else
	    {
	    while (NumOfPage--)
		{
		/* Store the number of data to be written */
		sEEDataNum = sEE_PAGESIZE;
		sEE_WritePage(pBuffer, WriteAddr, (uint8_t*) (&sEEDataNum));
		/* Wait transfer through DMA to be complete */
		sEETimeout = sEE_LONG_TIMEOUT;
		while (sEEDataNum > 0)
		    {
		    if ((sEETimeout--) == 0)
			{
			return I2C_ERROR;
			};
		    }
		sEE_WaitEepromStandbyState();
		WriteAddr += sEE_PAGESIZE;
		pBuffer += sEE_PAGESIZE;
		}

	    if (NumOfSingle != 0)
		{
		/* Store the number of data to be written */
		sEEDataNum = NumOfSingle;
		sEE_WritePage(pBuffer, WriteAddr, (uint8_t*) (&sEEDataNum));
		/* Wait transfer through DMA to be complete */
		sEETimeout = sEE_LONG_TIMEOUT;
		while (sEEDataNum > 0)
		    {
		    if ((sEETimeout--) == 0)
			{
			return I2C_ERROR;
			};
		    }
		sEE_WaitEepromStandbyState();
		}
	    }
	}
    /*!< If WriteAddr is not sEE_PAGESIZE aligned  */
    else
	{
	/*!< If NumByteToWrite < sEE_PAGESIZE */
	if (NumOfPage == 0)
	    {
	    /*!< If the number of data to be written is more than the remaining space
	     in the current page: */
	    if (NumByteToWrite > count)
		{
		/* Store the number of data to be written */
		sEEDataNum = count;
		/*!< Write the data contained in same page */
		sEE_WritePage(pBuffer, WriteAddr, (uint8_t*) (&sEEDataNum));
		/* Wait transfer through DMA to be complete */
		sEETimeout = sEE_LONG_TIMEOUT;
		while (sEEDataNum > 0)
		    {
		    if ((sEETimeout--) == 0)
			{
			return I2C_ERROR;
			};
		    }
		sEE_WaitEepromStandbyState();

		/* Store the number of data to be written */
		sEEDataNum = (NumByteToWrite - count);
		/*!< Write the remaining data in the following page */
		sEE_WritePage((uint8_t*) (pBuffer + count), (WriteAddr + count),
			(uint8_t*) (&sEEDataNum));
		/* Wait transfer through DMA to be complete */
		sEETimeout = sEE_LONG_TIMEOUT;
		while (sEEDataNum > 0)
		    {
		    if ((sEETimeout--) == 0)
			{
			return I2C_ERROR;
			};
		    }
		sEE_WaitEepromStandbyState();
		}
	    else
		{
		/* Store the number of data to be written */
		sEEDataNum = NumOfSingle;
		sEE_WritePage(pBuffer, WriteAddr, (uint8_t*) (&sEEDataNum));
		/* Wait transfer through DMA to be complete */
		sEETimeout = sEE_LONG_TIMEOUT;
		while (sEEDataNum > 0)
		    {
		    if ((sEETimeout--) == 0)
			{
			return I2C_ERROR;
			};
		    }
		sEE_WaitEepromStandbyState();
		}
	    }
	/*!< If NumByteToWrite > sEE_PAGESIZE */
	else
	    {
	    NumByteToWrite -= count;
	    NumOfPage = NumByteToWrite / sEE_PAGESIZE;
	    NumOfSingle = NumByteToWrite % sEE_PAGESIZE;

	    if (count != 0)
		{
		/* Store the number of data to be written */
		sEEDataNum = count;
		sEE_WritePage(pBuffer, WriteAddr, (uint8_t*) (&sEEDataNum));
		/* Wait transfer through DMA to be complete */
		sEETimeout = sEE_LONG_TIMEOUT;
		while (sEEDataNum > 0)
		    {
		    if ((sEETimeout--) == 0)
			{
			return I2C_ERROR;
			};
		    }
		sEE_WaitEepromStandbyState();
		WriteAddr += count;
		pBuffer += count;
		}

	    while (NumOfPage--)
		{
		/* Store the number of data to be written */
		sEEDataNum = sEE_PAGESIZE;
		sEE_WritePage(pBuffer, WriteAddr, (uint8_t*) (&sEEDataNum));
		/* Wait transfer through DMA to be complete */
		sEETimeout = sEE_LONG_TIMEOUT;
		while (sEEDataNum > 0)
		    {
		    if ((sEETimeout--) == 0)
			{
			return I2C_ERROR;
			};
		    }
		sEE_WaitEepromStandbyState();
		WriteAddr += sEE_PAGESIZE;
		pBuffer += sEE_PAGESIZE;
		}
	    if (NumOfSingle != 0)
		{
		/* Store the number of data to be written */
		sEEDataNum = NumOfSingle;
		sEE_WritePage(pBuffer, WriteAddr, (uint8_t*) (&sEEDataNum));
		/* Wait transfer through DMA to be complete */
		sEETimeout = sEE_LONG_TIMEOUT;
		while (sEEDataNum > 0)
		    {
		    if ((sEETimeout--) == 0)
			{
			return I2C_ERROR;
			}
		    }
		sEE_WaitEepromStandbyState();
		}
	    }
	}
    return I2C_OK;
    }

/**
 * @brief  Wait for EEPROM Standby state.
 *
 * @note  This function allows to wait and check that EEPROM has finished the
 *        last operation. It is mostly used after Write operation: after receiving
 *        the buffer to be written, the EEPROM may need additional time to actually
 *        perform the write operation. During this time, it doesn't answer to
 *        I2C packets addressed to it. Once the write operation is complete
 *        the EEPROM responds to its address.
 *
 * @param  None
 * @retval sEE_OK (0) if operation is correctly performed, else return value
 *         different from sEE_OK (0) or the timeout user callback.
 */
uint32_t sEE_WaitEepromStandbyState(void)
    {
    __IO uint16_t tmpSR1 = 0;
    __IO uint32_t sEETrials = 0;

