scenkov/ardurevo/Acopter32-STM32F4/libraries/AP_HAL_VRBRAIN/hardware/hal/i2c.c
    /*!< While the bus is busy */
    sEETimeout = sEE_LONG_TIMEOUT;
    while (I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BUSY ))
	{
	if ((sEETimeout--) == 0)
	    return I2C_ERROR;
	}

    /* Keep looping till the slave acknowledge his address or maximum number
     of trials is reached (this number is defined by sEE_MAX_TRIALS_NUMBER define
     in stm324xg_eval_i2c_ee.h file) */
    while (1)
	{
	/*!< Send START condition */
	I2C_GenerateSTART(sEE_I2C, ENABLE);

	/*!< Test on EV5 and clear it */
	sEETimeout = sEE_FLAG_TIMEOUT;
	while (!I2C_CheckEvent(sEE_I2C, I2C_EVENT_MASTER_MODE_SELECT ))
	    {
	    if ((sEETimeout--) == 0)
		return I2C_ERROR;
	    }

	/*!< Send EEPROM address for write */
	I2C_Send7bitAddress(sEE_I2C, sEEAddress, I2C_Direction_Transmitter );

	/* Wait for ADDR flag to be set (Slave acknowledged his address) */
	sEETimeout = sEE_LONG_TIMEOUT;
	do
	    {
	    /* Get the current value of the SR1 register */
	    tmpSR1 = sEE_I2C ->SR1;

	    /* Update the timeout value and exit if it reach 0 */
	    if ((sEETimeout--) == 0)
		return I2C_ERROR;
	    }
	/* Keep looping till the Address is acknowledged or the AF flag is
	 set (address not acknowledged at time) */
	while ((tmpSR1 & (I2C_SR1_ADDR | I2C_SR1_AF ))== 0);

	/* Check if the ADDR flag has been set */
if(	tmpSR1 & I2C_SR1_ADDR)
	    {
	    /* Clear ADDR Flag by reading SR1 then SR2 registers (SR1 have already
	     been read) */
	    (void)sEE_I2C->SR2;

	    /*!< STOP condition */
	    I2C_GenerateSTOP(sEE_I2C, ENABLE);

	    /* Exit the function */
	    return I2C_OK;
	    }
	else
	    {
	    /*!< Clear AF flag */
	    I2C_ClearFlag(sEE_I2C, I2C_FLAG_AF);
	    }

	/* Check if the maximum allowed number of trials has bee reached */
	if (sEETrials++ == sEE_MAX_TRIALS_NUMBER)
	    {
	    /* If the maximum number of trials has been reached, exit the function */
	    return sEE_TIMEOUT_UserCallback();
	    }
	}
    }
/**
 * @brief  This function handles the DMA Tx Channel interrupt Handler.
 * @param  None
 * @retval None
 */
void sEE_I2C_DMA_TX_IRQHandler(void)
    {
    /* Check if the DMA transfer is complete */
    if (DMA_GetFlagStatus(sEE_I2C_DMA_STREAM_TX, sEE_TX_DMA_FLAG_TCIF )
	    != RESET)
	{
	/* Disable the DMA Tx Stream and Clear TC flag */
	DMA_Cmd(sEE_I2C_DMA_STREAM_TX, DISABLE);
	DMA_ClearFlag(sEE_I2C_DMA_STREAM_TX, sEE_TX_DMA_FLAG_TCIF );

	/*!< Wait till all data have been physically transferred on the bus */
	sEETimeout = sEE_LONG_TIMEOUT;
	while (!I2C_GetFlagStatus(sEE_I2C, I2C_FLAG_BTF ))
	    {
	    if ((sEETimeout--) == 0)
		return;
	    }

	/*!< Send STOP condition */
	I2C_GenerateSTOP(sEE_I2C, ENABLE);

	/* Reset the variable holding the number of data to be written */
	*sEEDataWritePointer = 0;
	}
    }

/**
 * @brief  This function handles the DMA Rx Channel interrupt Handler.
 * @param  None
 * @retval None
 */
void sEE_I2C_DMA_RX_IRQHandler(void)
    {
    /* Check if the DMA transfer is complete */
    if (DMA_GetFlagStatus(sEE_I2C_DMA_STREAM_RX, sEE_RX_DMA_FLAG_TCIF )
	    != RESET)
	{
	/*!< Send STOP Condition */
	I2C_GenerateSTOP(sEE_I2C, ENABLE);

	/* Disable the DMA Rx Stream and Clear TC Flag */
	DMA_Cmd(sEE_I2C_DMA_STREAM_RX, DISABLE);
	DMA_ClearFlag(sEE_I2C_DMA_STREAM_RX, sEE_RX_DMA_FLAG_TCIF );

	/* Reset the variable holding the number of data to be read */
	*sEEDataReadPointer = 0;
	}
    }

/**
 * @brief  Basic management of the timeout situation.
 * @param  None.
 * @retval None.
 */
uint32_t sEE_TIMEOUT_UserCallback(void)
    {
    /* Block communication and all processes */
    while (1)
	{
	}
    }

